ServiceDesk/src/Catalogs/ВидыДеятельности/ВидыДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДеятельности</name>
  <predefined>
    <items>
      <name>Консультация</name>
      <description>1 - Консультация</description>
    </items>
    <items>
      <name>ИсправлениеОшибок</name>
      <description>2 - Ошибка разработчика</description>
    </items>
    <items>
      <name>Разработка</name>
      <description>3 - Разработка</description>
    </items>
    <items>
      <name>ОшибкиПользователей</name>
      <description>4 - Ошибка пользователя</description>
    </items>
    <items>
      <name>ОбработкаДанных</name>
      <description>5 - Обработка данных</description>
    </items>
  </predefined>
  <attributes>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПринятияВРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРешенияИнцедента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Постоянная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДляНовыхЗаявок</name>
      <description>Для новых заявок</description>
    </items>
  </predefined>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SYNC_TIME</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аутентификация</name>
    <comment>Windows аутентификация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аутсорсинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесНаправление</name>
    <type>
      <types>EnumRef.БизнесНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяБаза</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтправлятьОповещенияНаПочту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменитьПарольПриВходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/Catalogs/СостоянияЗаявки/СостоянияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗаявки</name>
  <predefined>
    <items>
      <name>ВОжидании</name>
      <description>В ожидании</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Закрыта</name>
      <description>Закрыта</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаКонтроле</name>
      <description>На контроле</description>
    </items>
    <items>
      <name>НаПроверке</name>
      <description>На проверке</description>
    </items>
    <items>
      <name>НаСогласовании</name>
      <description>На согласовании</description>
    </items>
    <items>
      <name>ОжиданиеОтвета</name>
      <description>Ожидание ответа заказчика</description>
    </items>
    <items>
      <name>ОписаниеПроектногоРешения</name>
      <description>Описание проектного решения</description>
    </items>
    <items>
      <name>Отменена</name>
      <description>Отменена</description>
    </items>
    <items>
      <name>ПереданаКИсполнению</name>
      <description>Передана к исполнению</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения1</name>
      <description>Согласование проектного решения</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения2</name>
      <description>Согласование проектного решения</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяУстанавливаемойДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнениеПлановыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/CommonModules/ЗаявкаПользователяКлиент/Module.bsl
#Область Оповещения

Процедура ОповещениеОписаниеДобавить(ЭтаФорма, Результат, ДополнительныеПараметры) Экспорт
	Если Результат = "ОК" Тогда
		ОбновитьОписаниеHTML(ЭтаФорма, ЭтаФорма.Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

Процедура ОповещениеЗаявкаОтменить(ЭтаФорма, Результат, ДополнительныеПараметры) Экспорт
	Если Результат = "ОК" Тогда
		Объект								= ЭтаФорма.Объект;
		ОписаниеHTML						= ЭтаФорма.ОписаниеHTML;
		КоличествоКомментариев				= ЭтаФорма.КоличествоКомментариев;
		ОписаниеРазработчикаHTML			= ЭтаФорма.ОписаниеРазработчикаHTML;
		КоличествоКомментариевРазработчика	= ЭтаФорма.КоличествоКомментариевРазработчика;

		СтруктураОтвета	= ЗаявкаПользователяВызовСервера.ПолучитьHTMLИзЗаявки(Объект.Ссылка);

		ОписаниеHTML						= СтруктураОтвета.ОписаниеHTML;
		КоличествоКомментариев				= "" + СтруктураОтвета.КоличествоКомментариев;
		ОписаниеРазработчикаHTML			= СтруктураОтвета.ОписаниеРазработчикаHTML;
		КоличествоКомментариевРазработчика	= "" + СтруктураОтвета.КоличествоКомментариевРазработчика;

		ЗаявкаПользователяКлиент.ПроверитьМодифицированностьФормы(ЭтаФорма, ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

Процедура ОповещениеВыбратьЗаказчика(ЭтаФорма, Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Объект	= ЭтаФорма.Объект;
		Объект.Заказчик	= Результат;
		ЗаявкаПользователяКлиент.ЗаказчикПриИзменении(ЭтаФорма, Неопределено);
	КонецЕсли;
КонецПроцедуры

Процедура ОповещениеПослеВводаДаты(ЭтаФорма, Время, ДополнительныеПараметры) Экспорт
	Если Время <> Неопределено Тогда
		ЗаявкаПользователяВызовСервера.ДобавитьВУРВСервер(ЭтаФорма.Объект.Ссылка, Время);
	КонецЕсли;
КонецПроцедуры

Процедура ОповещениеВыборИзМеню(ЭтаФорма, Результат, ДополнительныеПараметры) Экспорт
	Элементы	= ЭтаФорма.Элементы;
	ЭтаФорма.КомментарийОписания	= Неопределено;
	ЭтаФорма.АдресатВопроса		= Результат.Значение;
	Если Элементы.ГруппаСтаницыОписания.ТекущаяСтраница = Элементы.СтраницаОписаниеРазработчика Тогда
		Элементы.ГруппаКомментарийРазработчика.Видимость	= Истина;
	Иначе
		Элементы.ГруппаКомментарий.Видимость	= Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник) Экспорт
	Если ИмяСобытия = "ОбновитьОписаниеHTML" Тогда
		Если Параметр = ЭтаФорма.Объект.Ссылка Тогда
			ОбновитьОписаниеHTML(ЭтаФорма, ЭтаФорма.Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработчикОжиданияОписаниеДобавить(ЭтаФорма) Экспорт
	Элементы			= ЭтаФорма.Элементы;
	КомментарийОписания	= ЭтаФорма.КомментарийОписания;
	Если Элементы.ГруппаСтаницыОписания.ТекущаяСтраница = Элементы.СтраницаОписаниеРазработчика Тогда
		Элементы.КомментарийОписанияРазработчика.УстановитьГраницыВыделения(
			КомментарийОписания.ПолучитьЗакладкуНачала(), КомментарийОписания.ПолучитьЗакладкуНачала());
		Элементы.КомментарийОписанияСохранитьКомментарий1.КнопкаПоУмолчанию	= Истина;
	Иначе
		Элементы.КомментарийОписания.УстановитьГраницыВыделения(КомментарийОписания.ПолучитьЗакладкуНачала(),
			КомментарийОписания.ПолучитьЗакладкуНачала());
		Элементы.КомментарийОписанияСохранитьКомментарий.КнопкаПоУмолчанию	= Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

Процедура ПриПовторномОткрытии(ЭтаФорма) Экспорт
	ОбщегоНазначенияСервер.УдалитьОповещениеВФоне(ЭтаФорма.Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

Процедура ЗаказчикПриИзменении(ЭтаФорма, Элемент) Экспорт
	Объект	= ЭтаФорма.Объект;
	СтруктураОтвета				= ЗаявкаПользователяВызовСервера.ПолучитьРеквизитыЗаказчика(Объект.Заказчик);
	Объект.БизнесНаправление	= СтруктураОтвета.БизнесНаправление;
	ЭтаФорма.Организация		= СтруктураОтвета.Организация;
КонецПроцедуры

Процедура ИсполнительПриИзменении(ЭтаФорма, Элемент) Экспорт
	ЗаявкаПользователяКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, ЭтаФорма.СостояниеЗаявки);
	ЭтаФорма.ЗадачиСотрудника.Параметры.УстановитьЗначениеПараметра("Исполнитель", ЭтаФорма.Объект.Исполнитель);
КонецПроцедуры

Процедура ДатаВыполненияПриИзменении(ЭтаФорма, Элемент) Экспорт
	ЗаявкаПользователяКлиент.ИзменитьРелизЗаявки(ЭтаФорма);
	ЭтаФорма.ЗадачиСотрудника.Параметры.УстановитьЗначениеПараметра("ДатаВыполнения", ЭтаФорма.Объект.ДатаВыполнения
		+ 604800);
КонецПроцедуры

Процедура ВидДеятельностиПриИзменении(ЭтаФорма, Элемент) Экспорт

	Объект	= ЭтаФорма.Объект;
	Если Объект.ВидДеятельности <> ПредопределенноеЗначение("Справочник.ВидыДеятельности.Разработка")
		И Объект.ВидДеятельности <> ПредопределенноеЗначение("Справочник.ВидыДеятельности.ИсправлениеОшибок") Тогда
		Объект.Релиз		= ПредопределенноеЗначение("Справочник.Релизы.ПустаяСсылка");
		Объект.Тестировщик	= ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
	КонецЕсли;

	Если Истина И ЭтаФорма.СостояниеЗаявки <> ПредопределенноеЗначение("Справочник.СостоянияЗаявки.Зарегистрирована")
		И (Ложь Или Объект.ВидДеятельности = ПредопределенноеЗначение("Справочник.ВидыДеятельности.Разработка")
		Или Объект.ВидДеятельности = ПредопределенноеЗначение("Справочник.ВидыДеятельности.ИсправлениеОшибок")) Тогда
		ЗаявкаНеБылаРанееСогласована	= ЗаявкаПользователяВызовСервера.ПроверитьИсториюСогласования(Объект.Ссылка);
	Иначе
		ЗаявкаНеБылаРанееСогласована	= Ложь;
	КонецЕсли;

	ЗаявкаПользователяКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, ЭтаФорма.СостояниеЗаявки,
		ЗаявкаНеБылаРанееСогласована);

КонецПроцедуры

Функция ДобавитьКомментарий(ЭтаФорма, Команда) Экспорт
	ПодключитьОбработчикОжидания	= Ложь;
	Объект	= ЭтаФорма.Объект;
	Если Не ЗначениеЗаполнено(Объект.База1С) Тогда
		ОбщегоНазначенияКлиент.ПоказатьСообщениеПользователю(Объект.Ссылка, "Объект", "База1С",
			"Необходимо выбрать информационную систему");
	Иначе
		//СостояниеЗаявки	= ЭтаФорма.СостояниеЗаявки; 
		Элементы		= ЭтаФорма.Элементы;
		Если Объект.Ссылка.Пустая() Тогда
			ЗаявкаПользователяКлиент.ПроверитьМодифицированностьФормы(ЭтаФорма, Элементы.ЗаявкаЗарегистрировать);
		КонецЕсли;
		СостояниеЗаявки	= ЭтаФорма.СостояниеЗаявки;
		Если Не СостояниеЗаявки.Пустая() Тогда
			ЭтаФорма.КомментарийОписания	= Неопределено;
			Если Элементы.ГруппаСтаницыОписания.ТекущаяСтраница = Элементы.СтраницаОписаниеРазработчика Тогда
				Элементы.ГруппаКомментарийРазработчика.Видимость	= Истина;
			Иначе
				Элементы.ГруппаКомментарий.Видимость	= Истина;
			КонецЕсли;
			ПодключитьОбработчикОжидания	= Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат ПодключитьОбработчикОжидания;
КонецФункции

#КонецОбласти

#Область Служебные

Процедура УстановитьДоступностьЭлементовФормы(ЭтаФорма, Знач пСостояниеЗаявки = Неопределено,
	ЗаявкаНеБылаРанееСогласована = Ложь) Экспорт

	Элементы		= ЭтаФорма.Элементы;
	Объект			= ЭтаФорма.Объект;
	//СостояниеЗаявки	= ЭтаФорма.СостояниеЗаявки;

	Элементы.ЛеваяГруппа.Заголовок	= "" + пСостояниеЗаявки;

	Элементы.ДобавитьВУРВ.Видимость	= Истина;
	ДоступнаРольАдминистратор	= ОбщегоНазначенияПовторноеИспользование.сузРольДоступна("Администратор");
	ДоступнаРольКонсультант		= ОбщегоНазначенияПовторноеИспользование.сузРольДоступна("Консультант");
	//++Степовая 27.11.2019
	ДоступнаРольИсполнитель		= ОбщегоНазначенияПовторноеИспользование.сузРольДоступна("Исполнитель");
	//--Степовая 27.11.2019
	
	
	//Если пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.ОжиданиеОтвета") Тогда
	//	//++ SC-078466 Степовая 04.03.2020 
	//	//пСостояниеЗаявки	= ОбщегоНазначенияСервер.ПолучитьСостояниеЗаявки(Объект.Ссылка).СостояниеЗаявкиСтарое;
	//	Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеОжиданиеОтвета"];
	//	//-- SC-078466
	//КонецЕсли;

	Если ЗаявкаНеБылаРанееСогласована Тогда
		Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.НаСогласовании") Тогда
		Если ДоступнаРольАдминистратор Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеНаСогласовании"];
			Элементы.ЛеваяГруппа.ТолькоПросмотр	= Ложь;
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
			Элементы.ЛеваяГруппа.ТолькоПросмотр	= Истина;
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.ОжиданиеОтвета") Тогда
		Если ДоступнаРольКонсультант Или ДоступнаРольАдминистратор Или Объект.Исполнитель
			= ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеОжиданиеОтвета"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.ОписаниеПроектногоРешения") Тогда
		Если Объект.Исполнитель = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеПроектноеРешение"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.СогласованиеПроектногоРешения1") Тогда
		Если Объект.Архитектор1 = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеСогласоватьПроектноеРешение"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.СогласованиеПроектногоРешения2") Тогда
		Если Объект.Архитектор2 = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеСогласоватьПроектноеРешение"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.ПереданаКИсполнению") Тогда
		Если Объект.Исполнитель = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеПереданаКИсполнению"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.НаКонтроле") Тогда
		Если Объект.Контроллер = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеНаКонтроле"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.НаПроверке") Тогда
		Если Объект.Заказчик = ЭтаФорма.ТекущийПользователь Или Объект.Тестировщик = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеНаПроверке"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.Выполнена") Тогда
		Если Объект.Заказчик = ЭтаФорма.ТекущийПользователь Или ДоступнаРольКонсультант Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеВыполнена"];
		ИначеЕсли Объект.Исполнитель = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеВыполненаИсполнитель"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
		Элементы.ЛеваяГруппа.ТолькоПросмотр	= Истина;
		//++Степовая
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.Отменена") Тогда
		Если Объект.Заказчик = ЭтаФорма.ТекущийПользователь Или Объект.Исполнитель = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеОтменена"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
		Элементы.ЛеваяГруппа.ТолькоПросмотр	= Истина;
		//
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.Закрыта") Тогда
		Элементы.ДобавитьВУРВ.Видимость	= Ложь;
		Если Объект.Заказчик = ЭтаФорма.ТекущийПользователь Или Объект.Исполнитель = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеЗакрыта"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
		Элементы.ЛеваяГруппа.ТолькоПросмотр	= Истина;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.ВРаботе") Тогда
		Если Объект.Исполнитель = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеВРаботе"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.ВОжидании") Тогда
		Если Объект.Исполнитель = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеВОжидании"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.ПереданаКИсполнению") Тогда
		Если Объект.Исполнитель = ЭтаФорма.ТекущийПользователь Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеПереданаКИсполнению"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
	ИначеЕсли пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.Зарегистрирована") Тогда
		//++Степовая 27.11.19
		//Если ДоступнаРольАдминистратор	Или ОбщегоНазначенияПовторноеИспользование.сузРольДоступна("Пользователь") Тогда
		//    Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];			
		//Иначе
		//	Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеЗарегистрирована"];
		//КонецЕсли;

		Если ДоступнаРольАдминистратор Или ДоступнаРольКонсультант Или ДоступнаРольИсполнитель Тогда
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["СостояниеЗарегистрирована"];
		Иначе
			Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		КонецЕсли;
		
		//--Степовая 27.11.19	
		Элементы.ЛеваяГруппа.ТолькоПросмотр	= Ложь;

	ИначеЕсли Объект.Ссылка.Пустая() Тогда
		Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние"];
		Элементы.ДобавитьВУРВ.Видимость	= Ложь;
	//Иначе
	//	Элементы.ГруппаСтраницыДействий.ТекущаяСтраница	= Элементы["Состояние" + пСостояниеЗаявки.ИмяПредопределенныхДанных];
	КонецЕсли;

	Если Элементы.ГруппаСтраницыДействий.ТекущаяСтраница = Элементы["Состояние"] Тогда
		Элементы.ГруппаСтраницыДействий.Ширина	= 1;
	Иначе
		Элементы.ГруппаСтраницыДействий.Ширина	= 0;
	КонецЕсли;

	Если пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.ВРаботе") Тогда
		Если Объект.ВидДеятельности = ПредопределенноеЗначение("Справочник.ВидыДеятельности.Разработка")
			Или Объект.ВидДеятельности = ПредопределенноеЗначение("Справочник.ВидыДеятельности.ИсправлениеОшибок") Тогда
			Элементы.ПередатьНаКонтроль.Видимость	= Истина;
			Элементы.ЗаявкаВыполнено.Видимость		= Ложь;
		Иначе
			Элементы.ПередатьНаКонтроль.Видимость	= Ложь;
			Элементы.ЗаявкаВыполнено.Видимость		= Истина;
		КонецЕсли;
	КонецЕсли;

	Если Ложь Или пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.ПустаяСсылка")
		Или пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.Зарегистрирована")
		Или пСостояниеЗаявки = ПредопределенноеЗначение("Справочник.СостоянияЗаявки.НаСогласовании") Или ДоступнаРольАдминистратор Тогда
		Элементы.Заказчик.ТолькоПросмотр		= Ложь;
	Иначе
		Элементы.Заказчик.ТолькоПросмотр		= Истина;
	КонецЕсли;

	Если Ложь Или ЭтаФорма.ТекущийПользователь = Объект.Исполнитель Или ДоступнаРольАдминистратор Или ДоступнаРольКонсультант Тогда
		Элементы.ДатаВыполнения.ТолькоПросмотр	= Ложь;
		Элементы.Трудоёмкость.ТолькоПросмотр	= Ложь;
	Иначе
		Элементы.ДатаВыполнения.ТолькоПросмотр	= Истина;
		Элементы.Трудоёмкость.ТолькоПросмотр	= Истина;
	КонецЕсли;

	Если Объект.ВидДеятельности = ПредопределенноеЗначение("Справочник.ВидыДеятельности.Разработка")
		Или Объект.ВидДеятельности = ПредопределенноеЗначение("Справочник.ВидыДеятельности.ИсправлениеОшибок") Тогда
		Элементы.СтарницаРелиз.Видимость	= Истина;
		Элементы.Тестировщик.Видимость		= Истина;
		Элементы.Контроллер.Видимость		= Истина;
		Элементы.Архитектор1.Видимость		= Истина;
		Элементы.Архитектор2.Видимость		= Истина;
		Элементы.Релиз.Видимость			= Истина;
		Элементы.Проект.Видимость			= Истина;
		Элементы.РазделУчета.Видимость		= Ложь;
	Иначе
		Элементы.СтарницаРелиз.Видимость	= Ложь;
		Элементы.Тестировщик.Видимость		= Ложь;
		Элементы.Контроллер.Видимость		= Ложь;
		Элементы.Архитектор1.Видимость		= Ложь;
		Элементы.Архитектор2.Видимость		= Ложь;
		Элементы.Релиз.Видимость			= Ложь;
		Элементы.Проект.Видимость			= Ложь;
		Элементы.РазделУчета.Видимость		= Ложь;
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьОписаниеHTML(ЭтаФорма, Заявка)
	СтруктураОтвета	= ЗаявкаПользователяВызовСервера.ПолучитьHTMLИзЗаявки(Заявка);
	ЭтаФорма.СостояниеЗаявки					= ОбщегоНазначенияСервер.ПолучитьСостояниеЗаявки(Заявка).СостояниеЗаявки;
	ЭтаФорма.ОписаниеHTML						= СтруктураОтвета.ОписаниеHTML;
	ЭтаФорма.КоличествоКомментариев				= "" + СтруктураОтвета.КоличествоКомментариев;
	ЭтаФорма.ОписаниеРазработчикаHTML			= СтруктураОтвета.ОписаниеРазработчикаHTML;
	ЭтаФорма.КоличествоКомментариевРазработчика	= "" + СтруктураОтвета.КоличествоКомментариевРазработчика;
	ЗаявкаПользователяКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, ЭтаФорма.СостояниеЗаявки);
КонецПроцедуры

Процедура ИзменитьРелизЗаявки(ЭтаФорма) Экспорт //+Степовая Добавлено Экспорт
	Объект	= ЭтаФорма.Объект;
	СтруктураОтвета	= ЗаявкаПользователяВызовСервера.КонтрольРелизовСервер(Объект.База1С, Объект.ДатаВыполнения,
		Объект.ВидДеятельности);
	ЭтаФорма.КонтрольРелизов	= СтруктураОтвета.КонтрольРелизов;
	Если Объект.Релиз <> СтруктураОтвета.Релиз Тогда
		Объект.Релиз	= СтруктураОтвета.Релиз;
	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьМодифицированностьФормы(ЭтаФорма, Команда) Экспорт
	Если ЭтаФорма.Модифицированность Тогда
		Если ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
			ЗаявкаПользователяКлиент.ИзменитьСостояниеЗаявкиВФорме(ЭтаФорма, Команда);
		КонецЕсли;
	Иначе
		ЗаявкаПользователяКлиент.ИзменитьСостояниеЗаявкиВФорме(ЭтаФорма, Команда);
	КонецЕсли;
	//ЗаявкаПользователяКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, ЭтаФорма.СостояниеЗаявки);
КонецПроцедуры

Процедура ИзменитьСостояниеЗаявкиВФорме(ЭтаФорма, Команда) Экспорт

	Если ЭтаФорма.ПроверитьЗаполнение() Тогда

		Объект			= ЭтаФорма.Объект;

		СостояниеЗаявки	= ЭтаФорма.СостояниеЗаявки;
		Отказ			= Ложь;
		ЕстьИзменения	= Ложь;

		Если Команда.Имя = "ЗаявкаПередатьКИсполнению" Тогда
			Если Объект.Исполнитель.Пустая() Или Объект.Исполнитель = ПредопределенноеЗначение(
				"Справочник.Пользователи.ДляНовыхЗаявок") Тогда
				ОбщегоНазначенияКлиент.ПоказатьСообщениеПользователю(Объект.Ссылка, "Объект", "Исполнитель",
					"Укажите исполнителя");
				Отказ	= Истина;
			Иначе
				СостояниеЗаявки = ЗаявкаПользователяВызовСервера.ИзменитьСостояниеЗарегистрированнойЗаявки(
					Объект.Ссылка, Объект.ВидДеятельности);
			КонецЕсли;
		ИначеЕсли Команда.Имя = "ЗаявкаСогласовать" Тогда
			Если Объект.Исполнитель.Пустая() Или Объект.Исполнитель = ПредопределенноеЗначение(
				"Справочник.Пользователи.ДляНовыхЗаявок") Тогда
				ОбщегоНазначенияКлиент.ПоказатьСообщениеПользователю(Объект.Ссылка, "Объект", "Исполнитель",
					"Укажите исполнителя");
				Отказ	= Истина;
			Иначе
				Если Объект.ВидДеятельности = ПредопределенноеЗначение("Справочник.ВидыДеятельности.Разработка")
					Или Объект.ВидДеятельности = ПредопределенноеЗначение(
					"Справочник.ВидыДеятельности.ИсправлениеОшибок") Тогда
					Если Объект.Архитектор1.Пустая() Тогда
						ОбщегоНазначенияКлиент.ПоказатьСообщениеПользователю(Объект.Ссылка, "Объект", "Исполнитель",
							"Укажите архитектора №1");
						Отказ	= Истина;
					ИначеЕсли Объект.Архитектор2.Пустая() Тогда
						ОбщегоНазначенияКлиент.ПоказатьСообщениеПользователю(Объект.Ссылка, "Объект", "Исполнитель",
							"Укажите архитектора №2");
						Отказ	= Истина;
					ИначеЕсли Объект.Контроллер.Пустая() Тогда
						ОбщегоНазначенияКлиент.ПоказатьСообщениеПользователю(Объект.Ссылка, "Объект", "Исполнитель",
							"Укажите контроллера");
						Отказ	= Истина;
					ИначеЕсли Объект.Тестировщик.Пустая() Тогда
						ОбщегоНазначенияКлиент.ПоказатьСообщениеПользователю(Объект.Ссылка, "Объект", "Тестировщик",
							"Укажите тестировщика");
						Отказ	= Истина;
					Иначе
						СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка,
							"ОписаниеПроектногоРешения");
					КонецЕсли;
				Иначе
					СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка,
						"ПереданаКИсполнению");
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Команда.Имя = "ЗаявкаВРаботу" Тогда
			СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка, "ВРаботе");
		ИначеЕсли Команда.Имя = "ЗаявкаПередатьНаСогласованиеПроектноеРешение" Тогда
			Если Объект.Архитектор1.Пустая() Тогда
				ОбщегоНазначенияКлиент.ПоказатьСообщениеПользователю(Объект.Ссылка, "Объект", "Архитектор1",
					"Укажите архитектора №1");
				Отказ	= Истина;
			Иначе
				СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка,
					"СогласованиеПроектногоРешения1");
			КонецЕсли;
		ИначеЕсли Команда.Имя = "ЗаявкаСогласоватьПроектноеРешение" Тогда
			Если СостояниеЗаявки = ПредопределенноеЗначение(
				"Справочник.СостоянияЗаявки.СогласованиеПроектногоРешения1") Тогда
				Если Объект.Архитектор2.Пустая() Тогда
					ОбщегоНазначенияКлиент.ПоказатьСообщениеПользователю(Объект.Ссылка, "Объект", "Архитектор2",
						"Укажите архитектора №2");
					Отказ	= Истина;
				Иначе
					СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка,
						"СогласованиеПроектногоРешения2");
				КонецЕсли;
			Иначе
				СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка, "ПереданаКИсполнению");
			КонецЕсли;
		ИначеЕсли Команда.Имя = "ЗаявкаВернутьПРВРаботу" Тогда
			СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка, "ОписаниеПроектногоРешения");
		ИначеЕсли Команда.Имя = "ЗаявкаПередатьНаКонтроль" Тогда
			Если Объект.Контроллер.Пустая() Тогда
				ОбщегоНазначенияКлиент.ПоказатьСообщениеПользователю(Объект.Ссылка, "Объект", "Контроллер",
					"Укажите контроллера");
				Отказ	= Истина;
			Иначе
				СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка, "НаКонтроле");
			КонецЕсли;
		ИначеЕсли Команда.Имя = "ЗаявкаПередатьНаПроверку" Тогда
			СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка, "НаПроверке");
		ИначеЕсли Команда.Имя = "ЗаявкаВОжидании" Тогда
			СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка, "ВОжидании");
		ИначеЕсли Команда.Имя = "ЗаявкаВыполнено" Тогда
			СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка, "Выполнена");
		ИначеЕсли Команда.Имя = "ЗаявкаЗакрыть" Тогда
			СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка, "Закрыта");
		ИначеЕсли Команда.Имя = "ЗаявкаЗарегистрировать" Тогда
			СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка, "Зарегистрирована");
		ИначеЕсли Команда.Имя = "ЗаявкаОтменить" Тогда
			СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка, "Отменена");
		ИначеЕсли Команда.Имя = "ЗаявкаПолученОтвет" Тогда
			СостояниеЗаявки = ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Объект.Ссылка,
				ОбщегоНазначенияСервер.ПолучитьСостояниеЗаявки(Объект.Ссылка).СостояниеЗаявкиСтарое);
		КонецЕсли;

		Если Не Отказ Тогда
			ЭтаФорма.СостояниеЗаявки	= СостояниеЗаявки;
			ЗаявкаПользователяКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, СостояниеЗаявки);
			ЭтаФорма.ЕстьИзменения	= Истина;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти
